#!/usr/bin/env Python3
# จักรกฤษณ์ บุญเนตร
# 600510533
# Lab 02
# Problem 4
# 204111 Sec 01A

mil = int(input("Input number of milliseconds: "))
day = mil // 86400000  # (86400000 เสี้ยววิ = 1 วัน)
x = mil % 86400000  # หาเศษเหลือจากวันเพื่อนำไปหาต่อ
hou = x // 3600000  # (3600000 เสี้ยววิ = 1 ชม.)
x = x % 3600000  # หาเศษเหลือจากชม.เพื่อนำไปหาต่อ 
mi = x // 60000  # (60000 เสี้ยววิ = 1 นาที)
x = x % 60000  # หาเศษเหลือจากนาทีเพื่อนำไปหาต่อ
sec = x // 1000  # (1000 เสี้ยววิ = 1 วินาที)
x = x % 1000  # หาเศษเหลือจากวินาทีเพื่อนำไปหาต่อ
mil = x  # เสี้ยววิที่เหลือ

print("Results = %d day(s), %d hour(s) , %d minute(s) , %d second(s) , and %d millisec(s)" %
      (day, hou, mi, sec, mil))
