#!/usr/bin/env python3
# ชื่อ น.ส.จุฑาภรณ์  สิมมะลี
# 600510537
# Lab06
# Problem 3
# 204111 Sec 001


def main():
    x = int(input()) #นำค่าเข้า
    a = factorize(x)


def factorize(x):
    x_def = x #กำหนดให้ x_def = x ที่เป็นค่านำเข้า
    y = 2 #กำหนด y เริ่มต้นเท่ากับ 2
    print(x_def, "is ",end="") #แสดงคำตอบออกมา 
    while y <= ((x) ** 0.5) : #ตัวประกอบจำนวนเฉพาะที่เล็กที่สุดจะมีค่าไม่เกินรากที่สองของจำนวนนั้นๆ
        if (x % y == 0): #ถ้าหารลงตัว
            x = x // y
            print(y,end=" * ") #แสดงจำนวนที่หารจำนวนที่นำเข้าลงตัว

        if (y == 2) and (x % y != 0): #ถ้า y = 2 แต่หารไม่ลงตัว
            y = y + 1 #ให้เอา y + 1 จะได้ y = 3 แล้วเอาไปหารต่อ

        elif (y % 2 != 0) and (x % y != 0): #ถ้าหารสองไม่ลงตัว และหารจำนวนที่รับมาไม่ลงตัว
            y = y + 2 #นำ y มาบวก 2

    if x_def == x: #จำนวนเฉพาะ
        print("prime")
    elif x_def != x: #แสดงเศษของคำตอบที่เป็นตัวคูณตัวสุดท้ายที่ลงตัว
        print(x)
if __name__ == '__main__':
    main()
